Revit 2027 API
Application.UpdateRenderAppearanceLibrary Method
 Updates the stored render appearance library, giving the Revit session access to any new RPC content.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void UpdateRenderAppearanceLibrary()
Public Sub UpdateRenderAppearanceLibrary
public:
void UpdateRenderAppearanceLibrary()
member UpdateRenderAppearanceLibrary : unit -> unit
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace